{"class_name": "Model", "config": {"name": "LeNet", "layers": [{"name": "Input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 1], "dtype": "float32", "sparse": false, "name": "Input"}, "inbound_nodes": []}, {"name": "Conv_1", "class_name": "Conv2D", "config": {"name": "Conv_1", "trainable": true, "filters": 6, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"name": "Tanh_1", "class_name": "Activation", "config": {"name": "Tanh_1", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["Conv_1", 0, 0, {}]]]}, {"name": "AvgPool_1", "class_name": "AveragePooling2D", "config": {"name": "AvgPool_1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["Tanh_1", 0, 0, {}]]]}, {"name": "Conv_2", "class_name": "Conv2D", "config": {"name": "Conv_2", "trainable": true, "filters": 6, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["AvgPool_1", 0, 0, {}]]]}, {"name": "Tanh_2", "class_name": "Activation", "config": {"name": "Tanh_2", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["Conv_2", 0, 0, {}]]]}, {"name": "AvgPool_2", "class_name": "AveragePooling2D", "config": {"name": "AvgPool_2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["Tanh_2", 0, 0, {}]]]}, {"name": "Conv_3", "class_name": "Conv2D", "config": {"name": "Conv_3", "trainable": true, "filters": 120, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["AvgPool_2", 0, 0, {}]]]}, {"name": "Tanh_3", "class_name": "Activation", "config": {"name": "Tanh_3", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["Conv_3", 0, 0, {}]]]}, {"name": "Flatten", "class_name": "Flatten", "config": {"name": "Flatten", "trainable": true}, "inbound_nodes": [[["Tanh_3", 0, 0, {}]]]}, {"name": "FC_1", "class_name": "Dense", "config": {"name": "FC_1", "trainable": true, "units": 84, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Flatten", 0, 0, {}]]]}, {"name": "Tanh_4", "class_name": "Activation", "config": {"name": "Tanh_4", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["FC_1", 0, 0, {}]]]}, {"name": "FC_2", "class_name": "Dense", "config": {"name": "FC_2", "trainable": true, "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Tanh_4", 0, 0, {}]]]}, {"name": "softmax", "class_name": "Activation", "config": {"name": "softmax", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["FC_2", 0, 0, {}]]]}], "input_layers": [["Input", 0, 0]], "output_layers": [["softmax", 0, 0]]}, "keras_version": "2.1.2", "backend": "tensorflow"}